# Cápitulo 03 - Arquivo 04

In [48]:
# Importando bibliotecas e imprimir versão:
from platform import python_version
print('Versão Python:', python_version(), '\n')

import pandas as pd

%reload_ext watermark
%watermark -a "gustavogzr" --iversions

Versão Python: 3.11.1

Author: gustavogzr

pandas: 2.0.3

## Operações com DataFrames

In [49]:
# Cria um dicionário com pares de chave e valor
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                         index = ['Closing price', 'EPS',' Shares Outstanding(M)', 'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36], 
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'])}
stock # Imprime o dicionário

{'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64,
 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64,
 'FB': Closing price               61.48
 EPS                          0.59
  Shares Outstanding(M)    2450.00
 P/E                        104.93
 Market Cap(B)              150.92
 dtype: float64,
 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64,
 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64,
 'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 Market Cap(B)            447.59
 Beta                       0.84
 dtype: float64}

In [50]:
type(stock) # Imprime o tipo do objeto

dict

In [51]:
stock_df = pd.DataFrame(stock) # Converte o dicionário em um DataFrame
stock_df # Imprime o DataFrame

                          AMZN     GOOG       FB     YHOO    TWTR    AAPL
 Shares Outstanding(M)     NaN      NaN  2450.00      NaN     NaN     NaN
Beta                      0.52     0.87      NaN     0.66     NaN    0.84
Closing price           346.15  1133.43    61.48    34.90   65.25  501.53
EPS                       0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)           158.88   380.64   150.92    35.36   36.23  447.59
P/E                     589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)   459.00   335.83      NaN  1010.00  555.20  892.45

In [52]:
stock_df = pd.DataFrame(stock, 
                        index = ['Closing price',
                                 'EPS',
                                 'Shares Outstanding(M)',
                                 'P/E',
                                 'Market Cap(B)',
                                 'Beta']) # Define o índice do DataFrame
stock_df # Imprime o DataFrame

                         AMZN     GOOG      FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43   61.48    34.90   65.25  501.53
EPS                      0.59    36.05    0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83     NaN  1010.00  555.20  892.45
P/E                    589.80    31.44  104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64  150.92    35.36   36.23  447.59
Beta                     0.52     0.87     NaN     0.66     NaN    0.84

In [53]:
stock_df = pd.DataFrame(stock,
                        index = ['Closing price',
                                 'EPS',
                                 'Shares Outstanding(M)',
                                 'P/E',
                                 'Market Cap(B)',
                                 'Beta'],
                        columns = ['AMZN', 'GOOG', 'FB']) # Define as colunas do DataFrame
stock_df # Imprime o DataFrame

                         AMZN     GOOG      FB
Closing price          346.15  1133.43   61.48
EPS                      0.59    36.05    0.59
Shares Outstanding(M)  459.00   335.83     NaN
P/E                    589.80    31.44  104.93
Market Cap(B)          158.88   380.64  150.92
Beta                     0.52     0.87     NaN

In [54]:
stock_df.index # Imprime o índice do DataFrame

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [55]:
stock_df.columns # Imprime as colunas do DataFrame

Index(['AMZN', 'GOOG', 'FB'], dtype='object')

In [56]:
Quadro_Medalhas_Olimpiada = {
    'EUA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Inglaterra':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Alemanha':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Uruguai':{'Ouro':17, 'Prata':10, 'Bronze':15}} # Cria um dicionário com pares de chave e valor
Quadro_Medalhas_Olimpiada # Imprime o dicionário

{'EUA': {'Ouro': 46, 'Prata': 37, 'Bronze': 38},
 'China': {'Ouro': 26, 'Prata': 18, 'Bronze': 26},
 'Inglaterra': {'Ouro': 27, 'Prata': 23, 'Bronze': 17},
 'Alemanha': {'Ouro': 19, 'Prata': 18, 'Bronze': 19},
 'Uruguai': {'Ouro': 17, 'Prata': 10, 'Bronze': 15}}

In [57]:
df_olimpiada = pd.DataFrame.from_dict(Quadro_Medalhas_Olimpiada) # Converte o dicionário em um DataFrame
df_olimpiada # Imprime o DataFrame

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [58]:
type(df_olimpiada) # Imprime o tipo do objeto

pandas.core.frame.DataFrame

In [59]:
df_olimpiada['China'] # Imprime a coluna 'China'

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [60]:
Medalhas_China = df_olimpiada['China'] # Cria uma Series com os dados da coluna 'China'
Medalhas_China # Imprime a Series

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [61]:
type(Medalhas_China) # Imprime o tipo do objeto

pandas.core.series.Series

In [62]:
df_olimpiada.Uruguai # Imprime a coluna 'Uruguai'

Ouro      17
Prata     10
Bronze    15
Name: Uruguai, dtype: int64

In [63]:
df_olimpiada[['Alemanha','EUA']] # Imprime as colunas 'Alemanha' e 'EUA'

        Alemanha  EUA
Ouro          19   46
Prata         18   37
Bronze        19   38

In [64]:
df_olimpiada.get('Inglaterra') # Imprime a coluna 'Inglaterra'

Ouro      27
Prata     23
Bronze    17
Name: Inglaterra, dtype: int64

In [65]:
df_olimpiada # Imprime o DataFrame. Note que não houve alteração

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [66]:
df_olimpiada[:2] # Imprime as duas primeiras linhas do DataFrame

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [67]:
df_olimpiada[2:] # Imprime da terceira linha em diante do DataFrame

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [68]:
df_olimpiada[::2] # Imprime as linhas de dois em dois

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Bronze   38     26          17        19       15

In [69]:
df_olimpiada[::-2] # Inverte a ordem das linhas

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15
Ouro     46     26          27        19       17

In [70]:
df_olimpiada.loc['Ouro'] # Imprime a linha de índice 'Ouro'

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [71]:
df_olimpiada.loc[:, 'EUA'] # Imprime a coluna 'EUA'

Ouro      46
Prata     37
Bronze    38
Name: EUA, dtype: int64

In [72]:
df_olimpiada.loc['Prata', 'China'] # Imprime o valor da linha 'Prata' e coluna 'China'

18

In [73]:
df_olimpiada.loc['Prata']['China'] # Imprime o valor da linha 'Prata' e coluna 'China'

18

In [74]:
df_olimpiada.loc['Prata'] # Imprime a linha 'Prata'

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [75]:
df_olimpiada.loc['Ouro'] > 20 # Imprime os valores da linha 'Prata' maiores que 20

EUA            True
China          True
Inglaterra     True
Alemanha      False
Uruguai       False
Name: Ouro, dtype: bool

In [76]:
df_olimpiada.loc['Ouro', df_olimpiada.loc['Ouro'] > 20] # Imprime os valores da linha 'Ouro' maiores que 20

EUA           46
China         26
Inglaterra    27
Name: Ouro, dtype: int64

In [77]:
df_olimpiada.iloc[0] # Imprime a primeira linha do DataFrame

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [78]:
df_olimpiada.iloc[2] # Imprime a terceira linha do DataFrame

EUA           38
China         26
Inglaterra    17
Alemanha      19
Uruguai       15
Name: Bronze, dtype: int64

loc usa o nome da linha ou coluna e o iloc usa o índice numérico.

In [79]:
df_olimpiada.iloc[:2] # Imprime as duas primeiras linhas do DataFrame

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [80]:
df_olimpiada.iloc[2,0:2] # Imprime o valor da terceira linha e das duas primeiras colunas

EUA      38
China    26
Name: Bronze, dtype: int64

In [81]:
df_olimpiada.iloc[2:3, :] # Imprime a terceira linha do DataFrame

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [82]:
df_olimpiada.iloc[1,:] # Imprime a segunda linha do DataFrame

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [83]:
df_olimpiada.iloc[2, 0] # Imprime o valor da terceira linha e primeira coluna

38

In [84]:
del df_olimpiada['EUA'] # Deleta a coluna 'EUA'
df_olimpiada # Imprime o DataFrame

        China  Inglaterra  Alemanha  Uruguai
Ouro       26          27        19       17
Prata      18          23        18       10
Bronze     26          17        19       15

In [85]:
df_olimpiada.insert(0, 'Brasil', (17,16,23)) # Insere uma nova coluna no índice 0
df_olimpiada # Imprime o DataFrame

        Brasil  China  Inglaterra  Alemanha  Uruguai
Ouro        17     26          27        19       17
Prata       16     18          23        18       10
Bronze      23     26          17        19       15

In [86]:
df_olimpiada.describe() # Imprime um resumo estatístico do DataFrame

          Brasil      China  Inglaterra   Alemanha    Uruguai
count   3.000000   3.000000    3.000000   3.000000   3.000000
mean   18.666667  23.333333   22.333333  18.666667  14.000000
std     3.785939   4.618802    5.033223   0.577350   3.605551
min    16.000000  18.000000   17.000000  18.000000  10.000000
25%    16.500000  22.000000   20.000000  18.500000  12.500000
50%    17.000000  26.000000   23.000000  19.000000  15.000000
75%    20.000000  26.000000   25.000000  19.000000  16.000000
max    23.000000  26.000000   27.000000  19.000000  17.000000